const Document = {
  Заголовок: "",
  Тіло: "",
  Футер: "",
  Дата: "",
  Додаток: {
    Тема: "",
    Тіло: "",
    Футер: "",
    Дата: ""
  },
  заповнитиДокумент: function(заголовок, тіло, футер, дата) {
    this.Заголовок = заголовок;
    this.Тіло = тіло;
    this.Футер = футер;
    this.Дата = дата;
  },
  відобразитиДокумент: function() {
    console.log("Документ:");
    console.log("Заголовок:", this.Заголовок);
    console.log("Тіло:", this.Тіло);
    console.log("Футер:", this.Футер);
    console.log("Дата:", this.Дата);
    console.log("Додаток:");
    console.log("Тема:", this.Додаток.Тема);
    console.log("Тіло:", this.Додаток.Тіло);
    console.log("Футер:", this.Додаток.Футер);
    console.log("Дата:", this.Додаток.Дата);
  }
};

// Приклад використання
Document.заповнитиДокумент("Заголовок документа", "Тіло документа", "Футер документа", "18.05.2023");
Document.Додаток.Тема = "Тема додатка";
Document.Додаток.Тіло = "Тіло додатка";
Document.Додаток.Футер = "Футер додатка";
Document.Додаток.Дата = "18.05.2023";
Document.відобразитиДокумент();
